SRC/app/models/user.rb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 4]]
---
  def assign_default_role
    self.add_role(:user) if self.roles.blank?