SRC/app/controllers/products_controller.rb

  def show
     @product = Product.find params[:id]
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  def create
     @product = Product.new(product_params)
     @product.image.attach(image_params[:image])
     @product.user = current_user
     if @product.save
---
INSERT INTO "products" ("description", "price", "created_at", "updated_at", "name", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "dfggfd"], ["price", "0.0"], ["created_at", "2019-11-08 01:43:50.351750"], ["updated_at", "2019-11-08 01:43:50.351750"], ["name", "Motorbike Gloves"], ["user_id", 4]]
INSERT INTO "products" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-07 22:57:56.519579"], ["updated_at", "2019-11-07 22:57:56.519579"]]

  def self.create_product(name, description, price)
    product= Product.find_product(title, description, price)
    if (!product)
      product = Product.new(title: name, description: description, price: price)
      product.save
---
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2019-11-10 23:16:56.685815"], ["id", 1]]