app/controllers/orders_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @product = Product.find(params[:product_id])